Revit 2027 API
ParameterTypeId.TrussElementClassParam Property
 "Engineering Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TrussElementClassParam { get; }
Public Shared ReadOnly Property TrussElementClassParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TrussElementClassParam {
	ForgeTypeId^ get ();
}
static member TrussElementClassParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace